Revit 2026 API

# DocumentGetCloudModelPath Method

---

Gets the cloud model path of the cloud model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelPath GetCloudModelPath()
```
```vb
Public Function GetCloudModelPath As ModelPath
```
```cpp
public:
ModelPath^ GetCloudModelPath()
```
```fsharp
member GetCloudModelPath : unit -> ModelPath
```

#### Return Value

ModelPath The cloud model path

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This Document is a not cloud model, cannot execute this operation. |

#### Reference

Document Class

Autodesk.Revit.DB Namespace